# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "melonamin/formulae"

# Formulae
brew "bat"
brew "coreutils"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "lazygit"
brew "lua"
brew "mas"
brew "neovim"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "rustup-init"

brew "tealdeer"
brew "tig"
brew "tmux"
brew "universal-ctags"

# Casks
cask "alacritty"
cask "appcleaner"
cask "calibre"
cask "font-fira-code"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask 'maestral'
cask "squirrel"
cask "swiftbar"
cask "telegram"
cask "the-unarchiver"
cask "typora"
cask "visual-studio-code"

# Mac App Store Apps
mas "Reeder 4", id: 1449412482
mas "WeChat", id: 836500024
