# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "microsoft/git"

# Formulae
brew "bat"
brew "coreutils"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "lua"
brew "mas"
brew "neovim"
brew "node"
brew "python3"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "tealdeer"
brew "tig"
brew "tmux"

# Casks
cask "alacritty"
cask "appcleaner"
cask "calibre"
cask "font-fira-code"
cask "git-credential-manager-core"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask 'maestral'
cask 'obsidian'
cask 'raycast'
cask "telegram"
cask "the-unarchiver"
cask "typora"
cask "visual-studio-code"
cask "xbar"
cask "xcodes"

# Mac App Store Apps
mas "WeChat", id: 836500024
